{
    "context_examples":
        [
            {
                "context_id": 10000, 
                "context": "UNIVERSITY OF CALIFORNIA, MERCED\n\n \n\nBERKELEY * DAVIS + IRVINE * LOS ANGELES + MERCED + RIVERSIDE * SAN DIEGO * SAN FRANCISCO 2 SANTA BARBARA * SANTA CRUZ\n\n \n\n \n\nCSE24: Advanced Programming Syllabus\n\nSemester Fall 2022\n\nInstructor Dr. Angelo Kyrilov (akyrilov@ucmerced.edu)\n\nDesignation Advanced Programming\n\nCatalog Description This course is intended for students with basic to intermediate programming skills, and\n\nintroduces them to advanced programming techniques such as pointers and memory\nmanagement, exception handling, and object-based programming. The C++ language\nis used throughout the course.\n\nTextbook Advanced Programming with STEAMPlug (available through Follett Inclusive Access).\n\nCourse Objectives & |The main objective of this course is to build on the foundations from CSE22 and\nLearning Outcomes teach students how to write high-quality code, by utilizing advanced programming\ntechniques. Students taking the course will learn:\n\ne C++ basics\n\n— Variables and types\n— Operators\n— User 1/0\n\n— Control flow\ne Test-driven development\ne Pointers and pointer arithmetic\ne Dynamic memory allocation\ne Object-based programming:\n\n— Encapsulation\n— Constructors and destructors\n— Operator overloading\n\n— Memory management\ne Standard Template Library\n\ne Problem solving techniques\n\nPrerequisites CSE22\nCourse Policies\n\nGrades:\n\nImportant Dates\n\nAcademic Integrity\nPolicy\n\nDue to the Project-Based Learning nature of the course, students are expected to\nhave a laptop computer with access to the internet at all times in order to complete\npractical exercises and work through course materials, both in and out of class.\n\nAll homework and assignments are to be completed on STEAMPlug. Failure to\nadhere to this rule will result in a grade of 0 assigned for the particular assignment.\nFor example, if a student writes the code for a programming assignment outside\nSTEAMPlug and copy-pastes it in, the student will receive 0 points.\n\nStudents are expected to attend all lectures. Even though lecture materials will be\naccessible online and outside of lecture times, this course is officially an in-person\n\ncourse.\n\nStudents are expected to attend all exams, including midterms, finals and quizzes in\nperson. There will be no online versions of exams.\n\nStudents are expected to attend weekly laboratory exercises to put concepts covered\nin classes into practice, with the help of a Teaching Assistant.\nSemester grade will be made up as follows:\n\nLab Assignments 10%\n\nLab Quizes 10%\nMidterm Exam 30%\nFinal Exam 50%\n\nMidterm Examination - Wednesday, 10/12/2022, 1:30 pm - 2:45 am, COB2-140\n\nFinal Examination - Saturday, 12/10/2022, 11:30 am - 2:30 pm, COB2-140\n\nAcademic integrity is the foundation of an academic community. Academic integrity\napplies to research as well as undergraduate and graduate coursework. Academic\nmisconduct includes, but is not limited to cheating, fabrication, plagiarism, altering\ngraded examinations for additional credit, having another person take an examination\nfor you, or facilitating academic dishonesty or as further specified in this policy or\nother campus regulations.\nCheating is the unauthorized use of information in any academic exercise, or another\nattempt to obtain credit for work or a more positive academic evaluation of work\nthrough deception or dishonesty. Cheating includes, but is not limited to: copying\nfrom others during an examination; sharing answers for a take-home examination\nwithout permission; using notes without permission during an examination; using\nnotes stored on an electronic device without permission during an examination; using\nan electronic device to obtain information during an exam without permission; taking\nan examination for another student; asking or allowing another person to take an\nexamination for you; tampering with an examination after it has been corrected, then\nreturning it for more credit than deserved; submitting substantial portions of the\nsame academic work for credit in more than one course without consulting the second\ninstructor; preparing answers or writing notes in a blue book before an examination;\nfalsifying laboratory, or other research, data or using another person’s data without\nproper attribution; allowing others to do the research and writing of an assigned paper\n(for example, using a commercial term paper service or downloading a paper from\nthe internet); and working with another person on a project that is specified as an\nindividual project.\n\nPlagiarism refers to the use of another’s ideas or words without proper attribution\nor credit. This includes, but is not limited to: copying from the writings or works\nof others into one’s academic assignment without attribution, or submitting such\nwork as if it were one’s own; using the views, opinions, or insights of another without\nacknowledgment; or paraphrasing the ideas of another without proper attribution.\nCredit must be given: for every direct quotation; when work is paraphrased or\nsummarized, in whole or in part (even if only brief passages), in your own words; and\nfor information which is not common knowledge. The requirement to give credit applies\nto published sources, information obtained from electronic searches, and unpublished\nsources.\n\nCollusion is when any student knowingly or intentionally helps another student to\nperform any of the above acts of cheating or plagiarism. Students who collude are\nsubject to discipline for academic dishonesty. No distinction is made between those\nwho cheat or plagiarize and those who willingly facilitate cheating or plagiarism.\n\nCheating vs. Collaboration: Collaboration is a very good thing. On the other\nhand, cheating is considered a very serious offense. Please don’t do it! Concern about\ncheating creates an unpleasant environment for everyone. If you cheat, you risk losing\nyour position as a student in the college. The school’s policy on cheating is to report\nany cases to the university judicial office. What follows afterward is not fun. So how\ndo you draw the line between collaboration and cheating? Here’s a reasonable set of\nground rules. Failure to understand and follow these rules will constitute cheating and\nwill be dealt with as per university guidelines.\nComputer Science\nDepartment\nAcademic Honesty\nPolicy\n\nAs stated in the campus-wide Academic Honesty Policy (AHP), “academic integrity\nis the foundation of an academic community”. Accordingly, the CSE faculty takes\nthis matter very seriously and has embraced a zero tolerance on this matter. The\nprocess described in the following establishes the minimum consequences for violations\nof the AHP in CSE courses, but repercussions may be more severe for egregious\nviolations. The Computer Science Department Policy on Academic Honesty (“CSE\nPolicy” from now onwards), does not substitute the AHP but rather specifies how\nit will be implemented when students enrolled in classes offered by the Computer\nScience and Engineering (CSE) department are found in violation of the AHP. In\nparticular, the CSE Policy defines how the CSE faculty implements the “Instructor-Led\nProcess” described in AHP 802.00.A. This policy and the associated processes have\nbeen developed in collaboration with the Office of Student Conduct and the School of\nEngineering and is jointly implemented by the CSE Faculty, the School of Engineering,\nand the Office of Student Conduct. The CSE Policy becomes effective starting from\nthe Fall 2019 term.\n\nPreamble\n\nComputer science education relies on a variety of methods to assess students’ prepa-\nration and learning. The term “assignment” shall be interpreted as any method or\nprocess resulting in a grade or contributing to the final grade for a class. Accordingly,\nthe term “assignment” used in the following includes, but is not limited to: homeworks,\nquizzes, in-class exams, take-home exams, programming assignments, software projects,\nand presentations.\n\nShared Responsibility\n\nMaintaining an environment where academic integrity is valued and enforced requires\ncommitments by both instructors and students. Instructors will specify what type\nof collaboration is allowed or disallowed for a given assignment, and students should\nstrictly follow the provided guidelines. When in doubt, students should contact the\ninstructor and ask for clarification.\n\nFirst Infraction\n\nIf it is determined that a student has cheated, plagiarized, or otherwise violated the\nAHP, the student will receive a 0 (or equivalent grade) for the assignment. As per\nthe AHP, violations will be reported to the Dean of the School of Engineering and\nthe Office of Student Conduct for review of possible violations of the Code of Student\nConduct.\n\nAdditional Infractions\n\nThe School of Engineering keeps a record of all infractions reported by its faculty. If\nupon receiving a notification it is determined that the student has one or more prior\nviolations of the AHP, the School will inform the instructor who reported the new\nviolation. The additional violation will immediately lead to a failing grade (F) for the\ncourse. The student will be informed in writing and will not be allowed to withdraw\nfrom the class. According to CSE Policy, students should note that even the first\ninfraction in a class may lead to a failing grade if after reporting it is determined that\nthe student had been previously sanctioned for one or more infractions in other classes.\nStudents will have the right to appeal the instructor’s decision as per AHP 802.00.A.\nClass Cheating Policy\n\nSTEAMPIlug is equipped with plagiarism detection tools. If a student gets flagged\nfor potential plagiarism, the case will be reviewed by the instructional team, and if\ndeemed appropriate, it will be escalated according to the policy above. What this\nmeans is that we don’t simply report students for plagiarism because a software system\nflagged their work as suspicious. We conduct a thorough review first, during which\ntime we may solicit input from the student involved."
            }
        ]
}